{
  "num": 3,
  "job_title": "Software engineer",
  "company": "",
  "location": "",
  "time_posted": "",
  "job_type": "Full Time",
  "experience": "Experienced",
  "job_categories": "IT/Software Development",
  "job_skills": "Computer Science | Information Technology (IT) | Java | Programming | Software | Software Development | Software Engineering",
  "job_url": "https://wuzzuf.net/jobs/p/lIbXywvQeAQP-Software-engineer-ISST-FIBER-OCEAN-Cairo-Egypt",
  "description": "Job Description:\n• About ISST-FIBER OCEAN:\n• ISST-FIBER OCEAN is a leading UAE engineering infrastructure and Energy company providing comprehensive solutions to the telecommunications, Datacenter infrastructure, and power industries across Africa and the Middle East. We specialize in delivering high-quality products such as Fiber cables and accessories, cabinets & racks, DC power systems, lithium batteries, cooling solutions, Datacenter, and diesel generators, helping our customers achieve efficient, reliable, and scalable infrastructure solutions.\n• Job Description:\n• We are looking for a talented Software Engineer to join our dynamic team. The ideal candidate will have a strong background in software development and problem-solving skills, with experience in designing and developing software solutions for infrastructure projects. You will work on enhancing existing systems and developing new applications to optimize performance, support product integration, and provide data-driven insights.\n• As a Software Engineer, you will be part of a team that works closely with cross-functional departments, including hardware engineers and product management, to create seamless software solutions that support our products and services across the telecommunications and power sectors.\n• Key Responsibilities:\n• Design, develop, test, and maintain software applications that integrate with hardware products such as power systems, Data center DCIM, generators, and other infrastructure solutions.\n• Work with hardware engineers to ensure software applications seamlessly integrate with embedded systems and other product components.\n• Identify areas where software can enhance operational efficiency, performance, and user experience. Implement solutions to optimize systems.\n• Collaborate with cross-functional teams (R&D, engineering, and operations) to define software requirements and deliver integrated solutions for customers.\n• Prepare and maintain clear technical documentation, including software design, implementation, and deployment processes.\n• Provide ongoing support for existing software systems, including troubleshooting, bug fixing, and software updates.\n• Ensure software quality by conducting thorough testing and debugging to ensure robustness, performance, and security.\n• Work closely with the customer-facing teams to understand their needs and ensure that the developed software meets the functional and business requirements.",
  "job_requirements": [
    "Bachelor’s degree in Computer Science, Software Engineering, or a related field.",
    "7+ years of experience in software development, with a solid understanding of software engineering principles.",
    "Proficiency in programming languages such as Python, Java, C++, or similar.",
    "Experience with software development frameworks and tools (e.g., Git, Docker, Jenkins, etc.).",
    "Experience with SNMP configuration and integration.",
    "Experience with Data center DCIM implementation and 3rd party integration.",
    "Experience with networking configuration and related topology.",
    "Familiarity with database management systems (SQL/NoSQL) and experience working with large datasets.",
    "Strong problem-solving abilities and an analytical approach to resolving complex software issues.",
    "Experience with system integration and working on projects involving both software and hardware components.",
    "Knowledge of embedded systems or IoT technologies is a plus.",
    "Strong communication skills and the ability to work in a collaborative environment.",
    "Excellent attention to detail and the ability to deliver high-quality work under tight deadlines.",
    "Be part of a leading company shaping the future of power and telecommunications infrastructure.",
    "Work on innovative projects with a team of industry experts.",
    "Competitive compensation and benefits."
  ]
}